{
  "model_type": "swinv2",
  "architectures": ["Swinv2ForImageClassification"],
  "image_size": 448,
  "embed_dim": 128,
  "depths": [2, 2, 18, 2],
  "num_heads": [4, 8, 16, 32],
  "hidden_act": "gelu",
  "window_size": 10,
  "patch_size": 4,
  "drop_path_rate": 0.1,
  "qkv_bias": true,
  "layer_norm_eps": 1e-5,
  "num_channels": 3,
  "num_labels": 9083,
  "mlp_ratio": 4.0,
  "attention_probs_dropout_prob": 0.0,
  "pretrained_window_sizes": [0, 0, 0, 0],
  "hidden_dropout_prob": 0.0,
  "use_absolute_embeddings": false,
  "torch_dtype": "float32",
  "problem_type": "multi_label_classification"
}
